; domain
(define (domain ricochet-robots)
(:requirements :typing :adl :action-costs)

(:types
    robot - object
    cell - object
    direction - object
)

(:predicates
    ;; ?cnext is right next to ?c in the direction of ?dir
    (NEXT ?c - cell ?cnext - cell ?dir - direction)
    ;; moving from ?c in the direction ?dir is blocked
    (BLOCKED ?c - cell ?dir - direction)
    ;; Robot ?r is located in the cell ?c
    (at ?r - robot ?c - cell)
    ;; No robot is located in the cell ?c
    (free ?c - cell)
    ;; No robot is moving anywhere
    (nothing-is-moving)
    ;; Robot ?r is moving in the direction ?dir
    (is-moving ?r - robot ?dir - direction)
)

(:functions
    (total-cost) - number

    ;; The costs of actions are configurable.
    ;; If we want to count only the number of movements of robots instead of
    ;; counting all steps from a cell to cell (as it would be in the real
    ;; game), then we need to set
    ;;      (= (go-cost) 1)
    ;;      (= (step-cost) 0)
    ;;      (= (stop-cost) 0)
    (go-cost) - number
    (step-cost) - number
    (stop-cost) - number
)

;; Starts movement of the robot ?r in the direction ?dir
(:action go
    :parameters (?r - robot ?dir - direction)
    :precondition
        (and
            (nothing-is-moving)

            ;; If we want to make sure that the robot can actually make a step
            ;; in the specified direction, then we need to add the following
            ;; (and the corresponding parameters ?cfrom and ?cto):
            ;;
            ;; (at ?r ?cfrom)
            ;; (NEXT ?cfrom ?cto ?dir)
            ;; (free ?cto)
            ;; (not (BLOCKED ?cfrom ?dir))
        )
    :effect
        (and
            (not (nothing-is-moving))
            (is-moving ?r ?dir)
            (increase (total-cost) (go-cost))
        )
)

;; Make one step from the cell ?cfrom to the cell ?cto with the robot ?r
;; Robot is allowed to make the step only if it is the (only) one currently
;; moving, and it is moving in the direction ?dir
(:action step
    :parameters (?r - robot ?cfrom - cell ?cto - cell ?dir - direction)
    :precondition
        (and
            (at ?r ?cfrom)
            (not (BLOCKED ?cfrom ?dir))
            (free ?cto)
            (is-moving ?r ?dir)
            (NEXT ?cfrom ?cto ?dir)
        )
    :effect
        (and
            (not (at ?r ?cfrom))
            (free ?cfrom)
            (not (free ?cto))
            (at ?r ?cto)
            (increase (total-cost) (step-cost))
        )
)

;; Stopping of the robot is split between
;; (i) stop-at-barrier which stops the robot if it cannot move further due to
;;     a barrier expressed with (BLOCKED ...) predicate
;; (ii) stop-at-robot which stops the robot if the next step is blocked by
;;      another robot
(:action stop-at-barrier
    :parameters (?r - robot ?cat - cell ?dir - direction)
    :precondition
        (and
            (at ?r ?cat)
            (BLOCKED ?cat ?dir)
            (is-moving ?r ?dir)
        )
    :effect
        (and
            (not (is-moving ?r ?dir))
            (nothing-is-moving)
            (increase (total-cost) (stop-cost))
        )
)

(:action stop-at-robot
    :parameters (?r - robot ?cat - cell ?cnext - cell ?dir - direction)
    :precondition
        (and
            (at ?r ?cat)
            (not (free ?cnext))
            (is-moving ?r ?dir)
            (NEXT ?cat ?cnext ?dir)
        )
    :effect
        (and
            (not (is-moving ?r ?dir))
            (nothing-is-moving)
            (increase (total-cost) (stop-cost))
        )
)
)

; problem
;; Generated from file generate-9072.asp from the ASP competition 2015
;;
(define (problem ricochet-robots-5x5-None-247166)
(:domain ricochet-robots)

(:objects
    cell-1-1 cell-1-2 cell-1-3 cell-1-4 cell-1-5 cell-2-1 cell-2-2 cell-2-3 cell-2-4 cell-2-5 cell-3-1 cell-3-2 cell-3-3 cell-3-4 cell-3-5 cell-4-1 cell-4-2 cell-4-3 cell-4-4 cell-4-5 cell-5-1 cell-5-2 cell-5-3 cell-5-4 cell-5-5 - cell
    robot-1 robot-2 robot-3 robot-4 - robot
    west east north south - direction
)

(:init
    (NEXT cell-1-1 cell-1-2 south)
    (NEXT cell-1-2 cell-1-3 south)
    (NEXT cell-1-3 cell-1-4 south)
    (NEXT cell-1-4 cell-1-5 south)
    (NEXT cell-2-1 cell-2-2 south)
    (NEXT cell-2-2 cell-2-3 south)
    (NEXT cell-2-3 cell-2-4 south)
    (NEXT cell-2-4 cell-2-5 south)
    (NEXT cell-3-1 cell-3-2 south)
    (NEXT cell-3-2 cell-3-3 south)
    (NEXT cell-3-3 cell-3-4 south)
    (NEXT cell-3-4 cell-3-5 south)
    (NEXT cell-4-1 cell-4-2 south)
    (NEXT cell-4-2 cell-4-3 south)
    (NEXT cell-4-3 cell-4-4 south)
    (NEXT cell-4-4 cell-4-5 south)
    (NEXT cell-5-1 cell-5-2 south)
    (NEXT cell-5-2 cell-5-3 south)
    (NEXT cell-5-3 cell-5-4 south)
    (NEXT cell-5-4 cell-5-5 south)
    (NEXT cell-1-5 cell-1-4 north)
    (NEXT cell-1-4 cell-1-3 north)
    (NEXT cell-1-3 cell-1-2 north)
    (NEXT cell-1-2 cell-1-1 north)
    (NEXT cell-2-5 cell-2-4 north)
    (NEXT cell-2-4 cell-2-3 north)
    (NEXT cell-2-3 cell-2-2 north)
    (NEXT cell-2-2 cell-2-1 north)
    (NEXT cell-3-5 cell-3-4 north)
    (NEXT cell-3-4 cell-3-3 north)
    (NEXT cell-3-3 cell-3-2 north)
    (NEXT cell-3-2 cell-3-1 north)
    (NEXT cell-4-5 cell-4-4 north)
    (NEXT cell-4-4 cell-4-3 north)
    (NEXT cell-4-3 cell-4-2 north)
    (NEXT cell-4-2 cell-4-1 north)
    (NEXT cell-5-5 cell-5-4 north)
    (NEXT cell-5-4 cell-5-3 north)
    (NEXT cell-5-3 cell-5-2 north)
    (NEXT cell-5-2 cell-5-1 north)
    (NEXT cell-1-1 cell-2-1 east)
    (NEXT cell-2-1 cell-3-1 east)
    (NEXT cell-3-1 cell-4-1 east)
    (NEXT cell-4-1 cell-5-1 east)
    (NEXT cell-1-2 cell-2-2 east)
    (NEXT cell-2-2 cell-3-2 east)
    (NEXT cell-3-2 cell-4-2 east)
    (NEXT cell-4-2 cell-5-2 east)
    (NEXT cell-1-3 cell-2-3 east)
    (NEXT cell-2-3 cell-3-3 east)
    (NEXT cell-3-3 cell-4-3 east)
    (NEXT cell-4-3 cell-5-3 east)
    (NEXT cell-1-4 cell-2-4 east)
    (NEXT cell-2-4 cell-3-4 east)
    (NEXT cell-3-4 cell-4-4 east)
    (NEXT cell-4-4 cell-5-4 east)
    (NEXT cell-1-5 cell-2-5 east)
    (NEXT cell-2-5 cell-3-5 east)
    (NEXT cell-3-5 cell-4-5 east)
    (NEXT cell-4-5 cell-5-5 east)
    (NEXT cell-5-1 cell-4-1 west)
    (NEXT cell-4-1 cell-3-1 west)
    (NEXT cell-3-1 cell-2-1 west)
    (NEXT cell-2-1 cell-1-1 west)
    (NEXT cell-5-2 cell-4-2 west)
    (NEXT cell-4-2 cell-3-2 west)
    (NEXT cell-3-2 cell-2-2 west)
    (NEXT cell-2-2 cell-1-2 west)
    (NEXT cell-5-3 cell-4-3 west)
    (NEXT cell-4-3 cell-3-3 west)
    (NEXT cell-3-3 cell-2-3 west)
    (NEXT cell-2-3 cell-1-3 west)
    (NEXT cell-5-4 cell-4-4 west)
    (NEXT cell-4-4 cell-3-4 west)
    (NEXT cell-3-4 cell-2-4 west)
    (NEXT cell-2-4 cell-1-4 west)
    (NEXT cell-5-5 cell-4-5 west)
    (NEXT cell-4-5 cell-3-5 west)
    (NEXT cell-3-5 cell-2-5 west)
    (NEXT cell-2-5 cell-1-5 west)

    (BLOCKED cell-1-1 north)
    (BLOCKED cell-1-5 south)
    (BLOCKED cell-2-1 north)
    (BLOCKED cell-2-5 south)
    (BLOCKED cell-3-1 north)
    (BLOCKED cell-3-5 south)
    (BLOCKED cell-4-1 north)
    (BLOCKED cell-4-5 south)
    (BLOCKED cell-5-1 north)
    (BLOCKED cell-5-5 south)
    (BLOCKED cell-1-1 west)
    (BLOCKED cell-5-1 east)
    (BLOCKED cell-1-2 west)
    (BLOCKED cell-5-2 east)
    (BLOCKED cell-1-3 west)
    (BLOCKED cell-5-3 east)
    (BLOCKED cell-1-4 west)
    (BLOCKED cell-5-4 east)
    (BLOCKED cell-1-5 west)
    (BLOCKED cell-5-5 east)
    (BLOCKED cell-1-5 north)
    (BLOCKED cell-1-4 south)
    (BLOCKED cell-3-3 west)
    (BLOCKED cell-2-3 east)
    (BLOCKED cell-4-4 east)
    (BLOCKED cell-5-4 west)
    (BLOCKED cell-1-3 north)
    (BLOCKED cell-1-2 south)
    (BLOCKED cell-2-5 east)
    (BLOCKED cell-3-5 west)
    (BLOCKED cell-3-3 south)
    (BLOCKED cell-3-4 north)
    (BLOCKED cell-4-2 south)
    (BLOCKED cell-4-3 north)

    (free cell-1-1)
    (free cell-1-2)
    (free cell-1-3)
    (free cell-1-5)
    (free cell-2-1)
    (free cell-2-3)
    (free cell-2-5)
    (free cell-3-1)
    (free cell-3-3)
    (free cell-3-4)
    (free cell-3-5)
    (free cell-4-1)
    (free cell-4-2)
    (free cell-4-3)
    (free cell-4-4)
    (free cell-4-5)
    (free cell-5-1)
    (free cell-5-2)
    (free cell-5-3)
    (free cell-5-4)
    (free cell-5-5)

    (at robot-1 cell-2-2) ;; red
    (at robot-2 cell-3-2) ;; blue
    (at robot-3 cell-2-4) ;; green
    (at robot-4 cell-1-4) ;; yellow

    (nothing-is-moving)

    (= (total-cost) 0)
    (= (go-cost) 1)
    (= (step-cost) 0)
    (= (stop-cost) 0)
)
(:goal
    (and
        (at robot-2 cell-1-4)
        (nothing-is-moving)
    )
)
(:metric minimize (total-cost))
)

; plan
1. (go robot-3 south)
   deleted: (nothing-is-moving)
   added: (is-moving robot-3 south)
   goals met: 0 of 2
2. (step robot-3 cell-2-4 cell-2-5 south)
   deleted: (at robot-3 cell-2-4) (free cell-2-5)
   added: (free cell-2-4) (at robot-3 cell-2-5)
   goals met: 0 of 2
3. (stop-at-barrier robot-3 cell-2-5 south)
   deleted: (is-moving robot-3 south)
   added: (nothing-is-moving)
   goals met: 1 of 2
4. (go robot-1 west)
   deleted: (nothing-is-moving)
   added: (is-moving robot-1 west)
   goals met: 0 of 2
5. (step robot-1 cell-2-2 cell-1-2 west)
   deleted: (at robot-1 cell-2-2) (free cell-1-2)
   added: (free cell-2-2) (at robot-1 cell-1-2)
   goals met: 0 of 2
6. (stop-at-barrier robot-1 cell-1-2 west)
   deleted: (is-moving robot-1 west)
   added: (nothing-is-moving)
   goals met: 1 of 2
7. (go robot-2 west)
   deleted: (nothing-is-moving)
   added: (is-moving robot-2 west)
   goals met: 0 of 2
8. (step robot-2 cell-3-2 cell-2-2 west)
   deleted: (at robot-2 cell-3-2) (free cell-2-2)
   added: (free cell-3-2) (at robot-2 cell-2-2)
   goals met: 0 of 2
9. (stop-at-robot robot-2 cell-2-2 cell-1-2 west)
   deleted: (is-moving robot-2 west)
   added: (nothing-is-moving)
   goals met: 1 of 2
10. (go robot-2 south)
   deleted: (nothing-is-moving)
   added: (is-moving robot-2 south)
   goals met: 0 of 2
11. (step robot-2 cell-2-2 cell-2-3 south)
   deleted: (at robot-2 cell-2-2) (free cell-2-3)
   added: (free cell-2-2) (at robot-2 cell-2-3)
   goals met: 0 of 2
12. (step robot-2 cell-2-3 cell-2-4 south)
   deleted: (at robot-2 cell-2-3) (free cell-2-4)
   added: (free cell-2-3) (at robot-2 cell-2-4)
   goals met: 0 of 2
13. (stop-at-robot robot-2 cell-2-4 cell-2-5 south)
   deleted: (is-moving robot-2 south)
   added: (nothing-is-moving)
   goals met: 1 of 2
14. (go robot-4 north)
   deleted: (nothing-is-moving)
   added: (is-moving robot-4 north)
   goals met: 0 of 2
15. (step robot-4 cell-1-4 cell-1-3 north)
   deleted: (at robot-4 cell-1-4) (free cell-1-3)
   added: (free cell-1-4) (at robot-4 cell-1-3)
   goals met: 0 of 2
16. (stop-at-robot robot-4 cell-1-3 cell-1-2 north)
   deleted: (is-moving robot-4 north)
   added: (nothing-is-moving)
   goals met: 1 of 2
17. (go robot-2 west)
   deleted: (nothing-is-moving)
   added: (is-moving robot-2 west)
   goals met: 0 of 2
18. (step robot-2 cell-2-4 cell-1-4 west)
   deleted: (at robot-2 cell-2-4) (free cell-1-4)
   added: (free cell-2-4) (at robot-2 cell-1-4)
   goals met: 1 of 2
19. (stop-at-barrier robot-2 cell-1-4 west)
   deleted: (is-moving robot-2 west)
   added: (nothing-is-moving)
   goals met: 2 of 2
